Revit 2024 API
BuiltInFailures.AssemblyFailures.CouldNotChangeTypeOfAssembly Property
 Assembly cannot be changed to selected type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CouldNotChangeTypeOfAssembly { get; }
Visual Basic
Public Shared ReadOnly Property CouldNotChangeTypeOfAssembly As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CouldNotChangeTypeOfAssembly {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.AssemblyFailures Class
Autodesk.Revit.DB Namespace